app/controllers/addresses_controller.rb

  def create
    @address = Address.new address_params
    @address.user_id = current_user.id
    if @address.save
---
INSERT INTO "addresses" ("address", "city", "province", "postal_code", "country", "phone", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"