app/controllers/contacts_controller.rb

	def create
		@contact = Contact.new params.require(:contact).permit([:name, :email, :subject, :message])
		if @contact.save
---
INSERT INTO "contacts" ("name", "email", "subject", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rwgr"], ["email", "rgr@ijodv.com"], ["subject", "rg"], ["message", "rg"], ["created_at", "2016-12-14 23:08:53.243439"], ["updated_at", "2016-12-14 23:08:53.243439"]]