app/controllers/subscription_users_controller.rb

  def create
    @transaction = SubscriptionUser.new params.permit(:user_id, :subscription_id, :stripe_txn_id)
    stripe_customer = Stripe::Customer.create(
      description: "Payment for #{current_user.email}",
      source: params[:stripe_token]
    )
    current_user.stripe_customer_id = stripe_customer.id
    current_user.save
    stripe_charge = Stripe::Charge.create(
      amount: (session[:subscription_price] * 100).to_i,
      currency: "cad",
      customer: stripe_customer.id,
      description: "Payment for subscription #{session[:subscription_id]}"
    )
    byebug
    @transaction.user_id = current_user.id
    @transaction.subscription_id = session[:subscription_id]
    @transaction.stripe_txn_id = stripe_charge.id
    @transaction.save
    byebug
    if @transaction.save
      current_user.subscription_id = session[:subscription_id]
      current_user.save
      Card.create(card_id: stripe_customer.sources.data.first['id'], user_id: current_user.id)
      new_quantity = Subscription.find(session[:subscription_id]).quantity -=1
---
UPDATE "users" SET "stripe_customer_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["stripe_customer_id", "cus_9TjuKm26qHXSz3"], ["updated_at", "2016-10-31 20:30:53.406053"], ["id", 1]]
INSERT INTO "subscription_users" ("user_id", "subscription_id", "stripe_txn_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["subscription_id", 2], ["stripe_txn_id", "ch_19AmyjDExIEDk8ShEyBZFE4L"], ["created_at", "2016-10-31 21:06:25.673806"], ["updated_at", "2016-10-31 21:06:25.673806"]]
UPDATE "subscriptions" SET "quantity" = $1, "updated_at" = $2 WHERE "subscriptions"."id" = $3  [["quantity", 1], ["updated_at", "2016-10-31 21:07:15.948109"], ["id", 2]]
INSERT INTO "cards" ("card_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["card_id", "card_19AmyhDExIEDk8Shnn3Zxt2p"], ["user_id", 1], ["created_at", "2016-10-31 21:06:45.041565"], ["updated_at", "2016-10-31 21:06:45.041565"]]
SELECT  "cards".* FROM "cards"  ORDER BY "cards"."id" DESC LIMIT 1
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT 1  [["id", 2]]

  def refund
    byebug
		charge = SubscriptionUser.find(params[:id]).stripe_txn_id
---
SELECT  "subscription_users".* FROM "subscription_users" WHERE "subscription_users"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]