app/controllers/subscriptions_controller.rb

  def index
    @subscription = Subscription.all
---
SELECT "subscriptions".* FROM "subscriptions"

  def show
    @subscription = Subscription.find params[:id]
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT 1  [["id", 2]]